[
    {
      "bookId": 1,
      "bookName": "Pride and Prejudice",
      "author": "Jane Austen",
      "image": "https://i.ibb.co.com/wNphQTv/pride-and-prejudice-9781471134746-hr.jpg",
      "review": "Austen masterfully explores the societal constraints of early 19th-century England through the lens of romance and witty dialogue. Elizabeth Bennet's sharp intelligence and wit contrast beautifully with the reserved, prideful Mr. Darcy, creating one of the most memorable literary couples. The novel not only offers romance but also delves deeply into issues of class, morality, and the limitations imposed on women, making it a timeless classic.",
      "totalPages": 432,
      "rating": 4.5,
      "category": "Classic",
      "tags": ["Romance", "Society"],
      "publisher": "T. Egerton",
      "yearOfPublishing": 1813
    },
    {
      "bookId": 2,
      "bookName": "Moby Dick",
      "author": "Herman Melville",
      "image": "https://i.ibb.co.com/pfKpqWj/moby-dick-9781681779133-xlg.jpg",
      "review": "Melville’s 'Moby Dick' is much more than just a story of whaling; it is a deep dive into obsession, vengeance, and the darker sides of human nature. Captain Ahab's relentless pursuit of the great white whale symbolizes a man’s fight against the forces beyond his control. The novel is full of rich symbolism, vivid descriptions of life at sea, and philosophical meditations on existence. It remains a complex, layered work that challenges readers to contemplate the nature of humanity.",
      "totalPages": 585,
      "rating": 4.1,
      "category": "Classic",
      "tags": ["Adventure", "Nautical"],
      "publisher": "Harper & Brothers",
      "yearOfPublishing": 1851
    },
    {
      "bookId": 3,
      "bookName": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "image": "https://i.ibb.co.com/Yj2V6N0/the-hobbit-9781608873869-hr.jpg",
      "review": "In 'The Hobbit', Tolkien weaves a charming and adventurous tale that introduces readers to the magical world of Middle-earth. Bilbo Baggins’ journey from a timid, home-loving hobbit to a brave adventurer is not only filled with excitement but also with deep moral lessons about courage, friendship, and personal growth. The whimsical yet dangerous world, with its dragons, treasure, and mythical creatures, offers a delightful escape into fantasy, while setting the stage for the grander saga of 'The Lord of the Rings.'",
      "totalPages": 310,
      "rating": 4.7,
      "category": "Fantasy",
      "tags": ["Adventure", "Fantasy"],
      "publisher": "George Allen & Unwin",
      "yearOfPublishing": 1937
    },
    {
      "bookId": 4,
      "bookName": "War and Peace",
      "author": "Leo Tolstoy",
      "image": "https://i.ibb.co.com/SRcb0Rp/war-and-peace-9781524864989-xlg.jpg",
      "review": "Tolstoy's 'War and Peace' is a monumental work of literature, offering a panoramic view of Russian society during the Napoleonic Wars. With a vast cast of characters, Tolstoy intricately explores personal, familial, and political conflicts against the backdrop of historical events. Themes of love, loss, fate, and the inexorable march of history intertwine to create an epic that reflects both the grandeur and the tragedy of the human condition. Tolstoy's deep philosophical insights elevate the novel beyond a historical narrative, making it a profound meditation on life itself.",
      "totalPages": 1225,
      "rating": 4.3,
      "category": "Historical Fiction",
      "tags": ["War", "History", "Family"],
      "publisher": "The Russian Messenger",
      "yearOfPublishing": 1869
    },
    {
      "bookId": 5,
      "bookName": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "image": "https://i.ibb.co.com/D9TphBs/the-catcher-in-the-rye.jpg",
      "review": "Salinger’s 'The Catcher in the Rye' captures the alienation and confusion of youth with stunning precision. Through Holden Caulfield’s cynical and deeply personal narrative, readers are taken on a journey through the mind of a disillusioned teenager, grappling with the complexities of adulthood. The novel’s exploration of themes like innocence, identity, and societal expectations resonates with readers who feel caught between youth and maturity. Holden’s voice remains a powerful, relatable expression of teenage angst, even decades after its publication.",
      "totalPages": 277,
      "rating": 4.0,
      "category": "Fiction",
      "tags": ["Coming-of-Age", "Psychological"],
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 1951
    },
    {
      "bookId": 6,
      "bookName": "The Brothers Karamazov",
      "author": "Fyodor Dostoevsky",
      "image": "https://i.ibb.co.com/41QxGQg/the-brothers-karamazov-by-fyodor-dostoyevsky.jpg",
      "review": "A towering work of Russian literature, 'The Brothers Karamazov' is a philosophical exploration of faith, free will, and morality. The novel centers around the Karamazov family, particularly the strained relationships between the father and his sons, which ultimately leads to a dramatic murder and trial. Dostoevsky delves deep into questions of justice, spirituality, and the human condition, offering profound insights into the complexities of human nature. It's a masterful narrative that poses more questions than answers, challenging readers to wrestle with its ideas long after the final page.",
      "totalPages": 824,
      "rating": 4.6,
      "category": "Philosophical Fiction",
      "tags": ["Philosophy", "Family", "Crime"],
      "publisher": "The Russian Messenger",
      "yearOfPublishing": 1880
    },
    {
      "bookId": 7,
      "bookName": "The Lord of the Rings",
      "author": "J.R.R. Tolkien",
      "image": "https://i.ibb.co.com/8PKnzjz/the-lord-of-the-rings-9781608873821-hr.jpg",
      "review": "A legendary fantasy epic, 'The Lord of the Rings' transports readers to the rich and meticulously crafted world of Middle-earth. This timeless tale follows the struggle between good and evil, centered around the One Ring and its corrupting power. Tolkien’s unparalleled world-building, combined with unforgettable characters like Frodo, Gandalf, and Aragorn, ensures that this work stands as one of the greatest achievements in modern literature. With themes of friendship, sacrifice, and heroism, 'The Lord of the Rings' offers an enduring tale of hope in the face of overwhelming darkness.",
      "totalPages": 1216,
      "rating": 4.9,
      "category": "Fantasy",
      "tags": ["Adventure", "Fantasy", "Epic"],
      "publisher": "George Allen & Unwin",
      "yearOfPublishing": 1954
    },
    {
      "bookId": 8,
      "bookName": "Brave New World",
      "author": "Aldous Huxley",
      "image": "https://i.ibb.co.com/PZJ1PSC/Brave-New-World-First-Edition.jpg",
      "review": "Huxley’s 'Brave New World' is a haunting vision of a future where technology, consumerism, and conformity have eroded individuality and freedom. Set in a seemingly utopian society, the novel explores the dehumanizing effects of a world where people are engineered for specific societal roles, and emotions are chemically controlled. Huxley’s chilling foresight into the dangers of unchecked scientific progress and loss of personal freedom makes this novel both a gripping story and a deeply relevant social critique.",
      "totalPages": 311,
      "rating": 4.4,
      "category": "Dystopian Fiction",
      "tags": ["Dystopian", "Science Fiction"],
      "publisher": "Chatto & Windus",
      "yearOfPublishing": 1932
    },
    {
      "bookId": 9,
      "bookName": "The Alchemist",
      "author": "Paulo Coelho",
      "image": "https://i.ibb.co.com/yV9hjRc/the-alchamist.jpg",
      "review": "In 'The Alchemist', Paulo Coelho blends spirituality with adventure in a simple yet deeply philosophical narrative. The story follows Santiago, a shepherd boy, on his journey to discover a hidden treasure. Along the way, he learns important lessons about following one’s dreams, listening to one’s heart, and the interconnectedness of all things. Coelho’s lyrical writing and universal message about personal growth and self-discovery have made this novel an international phenomenon, touching the hearts of readers around the globe.",
      "totalPages": 208,
      "rating": 4.5,
      "category": "Philosophical Fiction",
      "tags": ["Adventure", "Spiritual"],
      "publisher": "HarperTorch",
      "yearOfPublishing": 1988
    },
    {
      "bookId": 10,
      "bookName": "The Da Vinci Code",
      "author": "Dan Brown",
      "image": "https://i.ibb.co.com/N7YhGgT/the-vinci-code.jpg",
      "review": "Dan Brown’s 'The Da Vinci Code' is a thrilling ride through art, history, and religious symbolism, as Robert Langdon unravels a complex mystery surrounding a hidden secret in the Catholic Church. The fast-paced narrative keeps readers on the edge of their seats, blending action with thought-provoking ideas about faith, history, and power. Brown’s intricate puzzles and twists ensure that the novel is both intellectually stimulating and highly entertaining. Despite its controversy, it has captivated millions worldwide.",
      "totalPages": 489,
      "rating": 4.2,
      "category": "Mystery",
      "tags": ["Thriller", "Conspiracy", "Adventure"],
      "publisher": "Doubleday",
      "yearOfPublishing": 2003
    },
    {
      "bookId": 11,
      "bookName": "Harry Potter and the Sorcerer's Stone",
      "author": "J.K. Rowling",
      "image": "https://i.ibb.co.com/BjgH9M1/harry-potter-ans-the-sorcerer-s-stone.jpg",
      "review": "In the first installment of the beloved Harry Potter series, J.K. Rowling introduces readers to the magical world of Hogwarts. The story follows young Harry as he discovers his true identity as a wizard and embarks on thrilling adventures alongside his friends Hermione and Ron. Full of rich world-building, exciting spells, and heartwarming moments, 'Harry Potter and the Sorcerer’s Stone' is an unforgettable tale of friendship, bravery, and the power of good over evil, captivating readers of all ages.",
      "totalPages": 309,
      "rating": 4.8,
      "category": "Fantasy",
      "tags": ["Fantasy", "Adventure", "Magic"],
      "publisher": "Bloomsbury",
      "yearOfPublishing": 1997
    },
    {
      "bookId": 12,
      "bookName": "The Grapes of Wrath",
      "author": "John Steinbeck",
      "image": "https://i.ibb.co.com/5BPwL0d/the-grapes-of-wrath.jpg",
      "review": "John Steinbeck’s 'The Grapes of Wrath' is a powerful exploration of the economic and social struggles faced by migrant families during the Great Depression. Through the story of the Joad family, Steinbeck captures the resilience of the human spirit in the face of immense hardship and injustice. The novel’s raw depiction of poverty, labor exploitation, and the American Dream resonates deeply, making it a cornerstone of American literature and a moving testament to the strength of ordinary people fighting for their dignity.",
      "totalPages": 464,
      "rating": 4.4,
      "category": "Historical Fiction",
      "tags": ["Social Justice", "Family", "History"],
      "publisher": "The Viking Press",
      "yearOfPublishing": 1939
    }
  ]
  